(* 9.1 リストの構造 *)
"日曜日" :: "月曜日" :: "火曜日" :: "水曜日" :: "木曜日" :: "金曜日" :: "土曜日" :: [] ;;

(* 9.2 リストの構文と型 *)
1 :: 2 :: 3 :: [] ;;
[1; 2; 3] ;;
1 :: [2; 3] ;;
1 :: 2 :: [3] ;;

[true; false; true] ;;

[] ;;

let lst = [1; 2; 3; 4; 5] ;;

[[1; 3]; [2]; [4; 1; 3; 5]; []; [2; 5]] ;;

(* 9.3 リストとパターンマッチ *)
match [] with
    [] -> 0
  | first :: rest -> first ;;

match [1; 2; 3] with
    [] -> 0
  | first :: rest -> first ;;

(* 9.4 再帰関数 *)
(* #use "functions/contain_zero.ml" ;; *)

(* 9.5 再帰関数に対するデザインレシピ *)
(* # use "functions/sum.ml" ;; *)

(* 9.6 テンプレートの場合 *)
(* # use "functions/count_A.ml" ;; *)